src/InformationRegisters/ДополнительныеСвойства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСвойства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/СУПУП/Ext/Module.bsl
Функция ПолучитьОтчет(ТекстJSON) Экспорт 
	
	ТекущаяИБ = ПараметрыСеанса.ТекущаяИБ;
	АдресСервиса = ПолучитьДополнительноеСвойствоИнформационнойБазы("СерверСУПУП_ТЕСТ", ТекущаяИБ);		
		
	Определение = Новый WSОпределения(АдресСервиса);   
    Прокси = Новый WSПрокси(Определение, "http://URI.com", "supUP", "supUPSoap");       
	
	Возврат Прокси.Report(ТекстJSON);
     
КонецФункции 

Функция ПолучитьДополнительноеСвойствоИнформационнойБазы(Свойство, ИБ = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ДополнительныеСвойства.Значение
					|ИЗ
					|	РегистрСведений.ДополнительныеСвойства КАК ДополнительныеСвойства
					|ГДЕ
					|	ДополнительныеСвойства.Свойство = &Свойство";
	
	Если ЗначениеЗаполнено(ИБ) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ДополнительныеСвойства.ИнформационнаяБаза = &ИнформационнаяБаза";
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ИБ);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ВыборкаРезультата = Результат.Выбрать();
		ВыборкаРезультата.Следующий();
		Возврат ВыборкаРезультата.Значение;
	КонецЕсли;
	
КонецФункции
